# Hive - In Built Functions

In [ ]:
#String Functions
select rpad('sudha',10,'*')
select lpad('sudha',10,'*')
select trim('      sudha     ')
select ltrim('      sudha')
select rtrim('sudha     ')
select upper('sudhakar')
select lower('SUDHAKAR')
select length('hello world this is hive sql')
select substr('hello world this is hive sql',7,5)
select initcap('hello world this is hive sql')
select reverse('SUDHAKAR')

select concat("ABC","DEF"); ==> Returns ABCDEF
select character_length("ABC"); ==> Returns 3
select concat_ws("|","1","2","3"); ==> Returns 1|2|3

select split("USA IS A PLACE"," "); Returns: ["USA","IS","A","PLACE"]

select instr("usa is a land of opportunity","is"); ==> Returns 5

select repeat("USA",5); ==> Returns USAUSAUSAUSAUSA
select replace("ABC CDF ABC CDF","CDF",'XYZ'); Returns ABC XYZ ABC XYZ

select collect_as_list(col) as list_elements ;

In [ ]:
#Date/Time Functions

select day/month/year (current_date)
select add_months(current_date,-1)
select months_between(current_date,date '2016-08-10')
select last_day(date '2016-08-10')
select next_day(date '2016-08-10','sun/mon/tue/wed/thu/fri/sat')

select to_date('2014-05-12'))
select round(months_between(current_date,to_date('2014-05-12')),0)
select trunc(current_date,'YYYY/MM/DD'
select date_format(current_date,'MM-dd-yyyy')
select date_add(current_date,10)
select date_sub(current_date,10)
select datediff(current_date,date'2014-05-21')

In [ ]:
#Conditional Functions

'isnull (col)' --> Return True if the value is NULL
SELECT salary,isnull(salary) FROM employee WHERE gender='M';
+---------+--------+
| salary  |  _c1   |
+---------+--------+
| 10000   | false  |
| NULL    | true   |
+---------+--------+

'isnotnull(col)'
SELECT salary,isnotnull(salary) FROM employee WHERE gender='M';
+---------+--------+
| salary  |  _c1   |
+---------+--------+
| 10000   | true   |
| NULL    | false  |
+---------+--------+

'If(boolean testCondition, T valueTrue, T valueFalseOrNull)'
SELECT salary,if(isnull(salary),'No Salary','Present Salary') FROM employee WHERE gender='M';
+---------+-----------------+
| salary  |       _c1       |
+---------+-----------------+
| 10000   | Present Salary  |
| NULL    | No Salary       |
+---------+-----------------+

'nvl(T value, T default_value)'
SELECT salary,Nvl(salary,-1) FROM employee WHERE gender='M';
+---------+--------+
| salary  |  _c1   |
+---------+--------+
| 10000   | 10000  |
| 30000   | 30000  |
| NULL    | -1     |
+---------+--------+

'COALESCE(T v1, T v2, â€¦)' => return the first non-null value amoung the list

# Case When Statements

In [ ]:
#1 type
SELECT salary,CASE salary WHEN 10000 THEN 1
                          WHEN 30000 THEN 2
                          ELSE 0
              END
FROM employee where gender='M';

+---------+------+
| salary  | _c1  |
+---------+------+
| 10000   | 1    |
| 30000   | 2    |
| NULL    | 0    |
+---------+------+

#2type
select salary,gender,
case when salary=10000 then 1
     when gender='M' then 2
     else '-1' END
from employee where gender = 'M';

+---------+---------+------+
| salary  | gender  | _c2  |
+---------+---------+------+
| 10000   | M       | 1    |
| 30000   | M       | 2    |
| NULL    | M       | 2    |
+---------+---------+------+